In [7]:
import pandas as pd
import sqlite3

## connection to the database

In [8]:
con = sqlite3.connect("../data/checking-logs.sqlite")

 ##  datetime from the pageviews table

In [9]:
pd.io.sql.read_sql(sql="SELECT datetime FROM pageviews WHERE uid LIKE 'user_%'", con=con)

                       datetime
0    2020-04-17 22:46:26.785035
1    2020-04-18 10:53:52.623447
2    2020-04-18 10:56:55.833899
3    2020-04-18 10:57:37.331258
4    2020-04-18 12:05:48.200144
..                          ...
982  2020-05-21 18:45:20.441142
983  2020-05-21 23:03:06.457819
984  2020-05-21 23:23:49.995349
985  2020-05-22 11:30:18.368990
986  2020-05-22 18:22:22.847815

[987 rows x 1 columns]

##  a new dataframe where the visits are counted and grouped by date

In [10]:
df = pd.io.sql.read_sql(
    sql="SELECT (strftime('%s', datetime) / 3600) \
        FROM pageviews",
    con=con,
)
df

      (strftime('%s', datetime) / 3600)
0                                440868
1                                440868
2                                440868
3                                440868
4                                440868
...                                 ...
1075                             441695
1076                             441695
1077                             441706
1078                             441707
1079                             441714

[1080 rows x 1 columns]

## Close connection

In [11]:
con.close()